src/Catalogs/SQLЗадания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>SQLЗадания</Name>
			<Comment>DEV-9782</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.SQLСервера</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отключено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадания</Name>
					<Comment>SD-66081</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.sqlТипыЗаданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сценарий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомандаСценария</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>SQLПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазваниеТипа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/SQLЗадания/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПараметрыТипНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ФВыбора = ПолучитьФорму("Справочник.SQLЗадания..Форма.ФормаВыбораТипа");
	ФВыбора.ВладелецФормы = Элемент;
	ФВыбора.Открыть();
КонецПроцедуры


&НаКлиенте
Процедура ПараметрыТипОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда 
		ТекСтрока = Элементы.Параметры.ТекущиеДанные;
		ТекСтрока.НазваниеТипа = ВыбранноеЗначение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СценарийКоммандаОткрытие(Элемент, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаКомандыСценария", ЭтотОбъект);
    ПоказатьВводСтроки(Оповещение,Элементы.Сценарий.ТекущиеДанные.КомандаСценария, "Введите команду", , Истина);
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеВводаКомандыСценария(Результат, Параметры) Экспорт
 
	Если Не Результат = Неопределено Тогда 
		ТекСтрока = Элементы.Сценарий.ТекущиеДанные;
		ТекСтрока.КомандаСценария = Результат; 
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
 
КонецПроцедуры
